tutorials/internal/Poiseullie/developing/system/profileAxis
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    parabolic profile at outlet

\*---------------------------------------------------------------------------*/
start           (0  0 0);
end             (12 0 0);

fields          (U);

axis            x; // The independent variable of the graph. Can be "x",
                          // "y", "z", "xyz" (all coordinates written out), or
                          // "distance" (from the start point).

#includeEtc "caseDicts/postProcessing/graphs/graphCell.cfg"

// ************************************************************************* //
